---
kind: other
id: Properties.T:Autodesk.Revit.DB.ViewNode
source: html/06eba9ea-de05-6cea-31c0-e5bb80ca3307.htm
---
# ViewNode Properties

Specifies whether the .NET object represents a valid Revit entity.